
* Treacl Examples Workspace
 :PROPERTIES:
 :header-args: :cache no  :session jupy-treacl :exports results
 :END:

#+BEGIN_SRC elisp :session                        :REM set venv - do this first
(shell-command-to-string  "ls -l /home/kleyn/projects/pyvenvs")
;(pyvenv-deactivate)
;(pyvenv-activate  "/home/kleyn/projects/pyvenvs/envB-py38-all")
;(shell-command-to-string "echo VIRTUAL_ENV=$VIRTUAL_ENV")
;(shell-command-to-string "which python")
;(shell-command-to-string "printenv")
;;(pyvenv-workon "scratchenv-SNmPgRMB")
#+END_SRC
#+RESULTS:
#+begin_example
total 56
drwxrwxr-x 7 kleyn kleyn 4096 Oct 23  2021 envA.A-py38-ml
drwxrwxr-x 6 kleyn kleyn 4096 Oct 23  2021 envA-py38
drwxrwxr-x 7 kleyn kleyn 4096 Oct 23  2021 envB-py38-all
drwxrwxr-x 7 kleyn kleyn 4096 Oct 25  2021 envC-py37
drwxrwxr-x 7 kleyn kleyn 4096 Oct 25  2021 envD.D-py39-ml
drwxrwxr-x 5 kleyn kleyn 4096 Oct 25  2021 envD-py39-clean
drwxrwxr-x 7 kleyn kleyn 4096 Oct 25  2021 envE-py39-all
drwxrwxr-x 5 kleyn kleyn 4096 Feb 19  2022 envE-py39-test
drwxrwxr-x 7 kleyn kleyn 4096 Aug  9  2022 envF.A-py310-all
drwxrwxr-x 5 kleyn kleyn 4096 Aug  9  2022 envF-py310-clean
drwxrwxr-x 7 kleyn kleyn 4096 Sep 11 16:13 envG-py311-all
drwxrwxr-x 5 kleyn kleyn 4096 Sep 11 16:01 envG-py311-clean
drwxrwxr-x 8 kleyn kleyn 4096 Aug  9  2022 junk
-rw-rw-r-- 1 kleyn kleyn   72 Sep 29  2021 Untitled.ipynb
#+end_example

#+begin_src jupyter-python                        :REM imports
import sys
from treacl import Treacl, tree_diff
from see import see
from importlib import reload 

#from treacl_tattrs import Treacl, tree_diff
#import pudb; bp = pudb.set_trace
#+end_src
#+RESULTS:

** Example: Geological eras
#+begin_src jupyter-python                        :REM example treacl tree: Geologiocal Periods


# use temp var "bd" (= boundary) to assign boundary date (millions of years before now) 
# to both start one period and beginning of another 
gts = Treacl()

gts.cenozoic.quaternary.holocene     = Treacl(type="epoch",  end=0.0, start=(bd :=    0.01))
gts.cenozoic.quaternary.pleistocene  = Treacl(type="epoch",  end=bd,  start=(bd :=    1.6 ))

gts.cenozoic.tertiary.pliocene       = Treacl(type="epoch",  end=bd,  start=(bd :=    5.3 ))
gts.cenozoic.tertiary.miocene        = Treacl(type="epoch",  end=bd,  start=(bd :=   23.7 ))
gts.cenozoic.tertiary.oligocene      = Treacl(type="epoch",  end=bd,  start=(bd :=   36.6 ))
gts.cenozoic.tertiary.eocene         = Treacl(type="epoch",  end=bd,  start=(bd :=   57.8 ))
gts.cenozoic.tertiary.paleocene      = Treacl(type="epoch",  end=bd,  start=(bd :=   65.5 ))

gts.mesozoic.cretaceous              = Treacl(type="period", end=bd,  start=(bd :=  144   ))
gts.mesozoic.jurassic                = Treacl(type="period", end=bd,  start=(bd :=  208   ))
gts.mesozoic.triassic                = Treacl(type="period", end=bd,  start=(bd :=  245   ))

gts.paleozoic.permian                = Treacl(type="period", end=bd,  start=(bd :=  286   ))
gts.paleozoic.carboniferous          = Treacl(type="period", end=bd,  start=(bd :=  360   ))
gts.paleozoic.devonian               = Treacl(type="period", end=bd,  start=(bd :=  408   ))
gts.paleozoic.silurian               = Treacl(type="period", end=bd,  start=(bd :=  438   ))
gts.paleozoic.ordovician             = Treacl(type="period", end=bd,  start=(bd :=  505   ))
gts.paleozoic.cambrian               = Treacl(type="period", end=bd,  start=(bd :=  570   ))

gts.precambrian.proterozoic          = Treacl(type="eon",    end=bd,  start=(bd := 2500   ))
gts.precambrian.archean              = Treacl(type="eon",    end=bd,  start=(bd := 3800   ))
gts.precambrian.hadean               = Treacl(type="eon",    end=bd,  start=       4600    )

#for e in gts.attrs_list(): gts.evp(f".{e}").addProp("type","era")
#for e in gts.attrs_list(): print(gts.evp(f".{e}").getProp("type"))

gts.pptree()

#+end_src
#+RESULTS:
#+begin_example
#+end_example

** Example: Person
#+begin_src jupyter-python                        :REM example treacl tree: Person 

def personExample(v=21):
    person = Treacl()
    person.age          = 25
    person.name.first   = "John"
    person.name.last    = "Smith"

    return person

def personExample1(v=21):
    person = Treacl()
    person.age          = 25
    person.name.first   = "John"
    person.name.last    = "Smith"

    person.address.street.name        = "Maple"
    person.address.street.number      = v
    person.address.city               = "New York"
    person.address.state.name         = "NY"
    person.address.postalCode         = "10021"
    person.address.state.abbreviation = "NY"
    person.address.state.flower       = "Rose"
    person.address.state.capital      = "Albany"

    person.address.state.neighbour = [Treacl() for x in range(5)]
    person.address.state.neighbour[0].name = "Connecticut"
    person.address.state.neighbour[0].abbreviation = "CT"
    person.address.state.neighbour[0].type = "state"

    person.address.state.neighbour[1].name = "Massachusetts"
    person.address.state.neighbour[1].abbreviation = "MA"
    person.address.state.neighbour[1].type = "state"

    person.address.state.neighbour[2].name = "New Jersey"
    person.address.state.neighbour[2].abbreviation = "NJ"
    person.address.state.neighbour[2].type = "state"

    person.address.state.neighbour[3].name = "Ontario"
    person.address.state.neighbour[3].abbreviation = "ON"
    person.address.state.neighbour[3].type = "province"

    person.address.state.neighbour[4].name = "Pennsylvania"
    person.address.state.neighbour[4].abbreviation = "PA"
    person.address.state.neighbour[4].type = "state"

    # person.address.state.neighbour[5].name = "Quebec"
    # person.address.state.neighbour[5].abbreviation = "QB"
    # person.address.state.neighbour[5].type = "province"

    # person.address.state.neighbour[6].name = "Vermont"
    # person.address.state.neighbour[6].abbreviation = "VT"
    # person.address.state.neighbour[6].type = "state"

    person.phoneNumbers  = [Treacl() for x in range(3)]
    person.phoneNumbers[0].type   = "home"
    person.phoneNumbers[0].number = "212 555-1234"
    person.phoneNumbers[1].type   = "fax"
    person.phoneNumbers[1].number = "646 555-4567"
    person.phoneNumbers[2].type   = "mobile"
    person.phoneNumbers[2].number = "646 555-1231"

    person.cars  = [Treacl() for x in range(3)]
    person.cars[0].make  = "Honda"
    person.cars[0].model = "Prelude"
    person.cars[1].make  = "Chevrolet"
    person.cars[1].model = "Impala"
    person.cars[2].make  = "Audi"
    person.cars[2].model = "A5"

    person.sex.type = "male"
    person.status   = "single"

    return person

person = personExample1()
#person.pptree()                  # no result, formatted print
for p in person.tree_paths_to_list(): print(p)

if False:
    tstExpr = argv1                              #'..st*'
    print(f'tstExpr={tstExpr}\n')
    #for x in person.tree_find_paths_pathex(tstExpr): print(x)
    res = person.tree_find_paths_pathex(tstExpr, valP=argv2, printP=argv3)
    # print(res)

if False:
    tPath = argv1                              #'..st*'
    print(f'{tPath=}\n')
    print(f"EVALP person{tPath} =", person.eval_path(tPath))

if False:
    person2 = personExample(2)
    tree_diff(person, person2)
#+end_src
#+RESULTS:
#+begin_example
  .age
  .name
  .name.first
  .name.last
  .address
  .address.street
  .address.street.name
  .address.street.number
  .address.city
  .address.state
  .address.state.name
  .address.state.abbreviation
  .address.state.flower
  .address.state.capital
  .address.state.neighbour
  .address.state.neighbour[0]
  .address.state.neighbour[0].name
  .address.state.neighbour[0].abbreviation
  .address.state.neighbour[0].type
  .address.state.neighbour[1]
  .address.state.neighbour[1].name
  .address.state.neighbour[1].abbreviation
  .address.state.neighbour[1].type
  .address.state.neighbour[2]
  .address.state.neighbour[2].name
  .address.state.neighbour[2].abbreviation
  .address.state.neighbour[2].type
  .address.state.neighbour[3]
  .address.state.neighbour[3].name
  .address.state.neighbour[3].abbreviation
  .address.state.neighbour[3].type
  .address.state.neighbour[4]
  .address.state.neighbour[4].name
  .address.state.neighbour[4].abbreviation
  .address.state.neighbour[4].type
  .address.postalCode
  .phoneNumbers
  .phoneNumbers[0]
  .phoneNumbers[0].type
  .phoneNumbers[0].number
  .phoneNumbers[1]
  .phoneNumbers[1].type
  .phoneNumbers[1].number
  .phoneNumbers[2]
  .phoneNumbers[2].type
  .phoneNumbers[2].number
  .cars
  .cars[0]
  .cars[0].make
  .cars[0].model
  .cars[1]
  .cars[1].make
  .cars[1].model
  .cars[2]
  .cars[2].make
  .cars[2].model
  .sex
  .sex.type
  .status
#+end_example




print("ARGV:",sys.argv)
argv1 = '..'
argv2 = False
argv3 = False
if len(sys.argv)>=2: argv1 = sys.argv[1]
if len(sys.argv)>=3: argv2 = bool(int(sys.argv[2]))
if len(sys.argv)>=4: argv3 = bool(int(sys.argv[3]))



#pexpr = "phoneNumbers[0].number"
#print(f"EVALP person.{pexpr} =", person.eval_path(pexpr))

#for x in person.tree_paths_pathexpr_dfs(tstExpr): print(x)
# *       matches everything
# ?       matches any single character
# [seq]   matches any character in seq
# [!seq]  matches any char not in seq

#person.listProps()
#person.attrs_list()
#person.ppattrs()                 # no result, formatted print


#for p in person.tree_paths_to_list(): print(p)
#person.tree_nodes_to_list()

#person.tree_find_paths_regex("ty.e")
#person.tree_find_paths_regex("ty?e") # maybe y
#person.tree_find_paths_pathex("*.*")
#person.tree_find_paths_pathex("..make..")
#person.tree_to_json()

#person.tree_paths_pathexpr_dfs(self, pthExpr="..", cpth="")
#person.tree_paths_pathexpr_dfs()
#person.tree_paths_pathexpr_dfs("cars*")
#bp()


#print()
#for x in person.tree_paths_to_list(): print(x)
#tstExpr = '..addr*'           # ok
#tstExpr = '..addr*..*'

#tstExpr = '..'                # ok
#print(f'tstExpr={tstExpr}\n')
#for x in person.tree_paths_pathexpr_dfs(tstExpr): print(x)
#print()

#ss

